{
  "informations_personnelles": {
    "nom": "Corentin Braud",
    "titre": "Développeur",
    "portrait": "assets/portrait.jpg",
    "email": "corentin.braud95@gmail.com",
    "telephone": "06 38 66 82 47"
  },
  "parcours": {
    "presentation": [
      "Bonjour, je suis un jeune développeur français vivant à Paris.",
      "Passionné par le développement et rendre les choses plus efficaces, j'adore explorer de nouvelles technologies et je suis toujours en quête de nouvelles compétences à acquérir."
    ],
    "details": [
      "Mon entrée dans la vie professionnelle (pour l’aspect développement) s’est faite chez Display Interactive il y a maintenant presque deux ans, où j’ai intégré l’équipe Opérations. Travaillant quotidiennement avec PHP et Python, j’ai rapidement découvert l’importance de la polyvalence dans un environnement dynamique, où les échanges constants entre équipes sont essentiels. Tout cela m’a permis de comprendre les rouages d’une structure complète tout en m’obligeant à développer de nouvelles bases techniques.",
      "Très vite, j’ai ressenti le besoin d’aller plus loin : d’apporter des solutions durables plutôt que de simplement éteindre les incendies du quotidien. Cette ambition m’a conduit à faire évoluer mon rôle, à améliorer les processus internes, à optimiser les outils existants et à structurer la documentation technique de l’équipe. Ces initiatives ont eu un impact significatif sur la façon dont j’étais perçu et m’ont permis d’évoluer davantage.",
      "Aujourd’hui, je suis fier d’être devenu un point de référence au sein de mon équipe. J’ai eu la chance de recruter et de former deux personnes qui sont désormais mes pairs, et de voir mes idées contribuer au bon fonctionnement global de l’entreprise."
    ],
    "experiences": [
      {
        "titre": "Support technique et ingestion de contenu",
        "entreprise": "Display Interactive",
        "dates": "Mars 2024 à aujourd'hui"
      },
      {
        "titre": "Régisseur technique",
        "entreprise": "Who's next",
        "dates": "Janvier 2024"
      },
      {
        "titre": "Assistant réalisateur / Chef opérateur",
        "entreprise": "ID Production",
        "dates": "Novembre 2022 à Octobre 2023"
      },
      {
        "titre": "Serveur en restauration",
        "entreprise": "Restaurant le Golf",
        "dates": "Octobre 2022 à Décembre 2022"
      },
      {
        "titre": "Animateur en centre de loisirs",
        "entreprise": "Ville de Gonesse",
        "dates": "Septembre 2021 à Septembre 2022"
      }
    ]
  },
  "stack": [
    {
      "nom": "VSCode",
      "logo": "assets/stack/vscode-icon.svg"
    },
    {
      "nom": "Cursor",
      "logo": "assets/stack/cursor-icon.svg"
    },
    {
      "nom": "Notion",
      "logo": "assets/stack/notion-icon.svg"
    },
    {
      "nom": "TypeScript",
      "logo": "assets/stack/typescript-icon.svg"
    },
    {
      "nom": "React.js",
      "logo": "assets/stack/react-icon.svg"
    },
    {
      "nom": "Sass",
      "logo": "assets/stack/sass-icon.svg"
    },
    {
      "nom": "Python",
      "logo": "assets/stack/python-icon.svg"
    },
    {
      "nom": "PHP",
      "logo": "assets/stack/php-icon.svg"
    },
    {
      "nom": "JSON",
      "logo": "assets/stack/json-icon.svg"
    },
    {
      "nom": "MySQL",
      "logo": "assets/stack/mysql-icon.svg"
    },
    {
      "nom": "Bash",
      "logo": "assets/stack/bash-icon.svg"
    },
    {
      "nom": "Git",
      "logo": "assets/stack/git-icon.svg"
    },
    {
      "nom": "GitLab",
      "logo": "assets/stack/gitlab-icon.svg"
    },
    {
      "nom": "Postman",
      "logo": "assets/stack/postman-icon.svg"
    },
    {
      "nom": "Figma",
      "logo": "assets/stack/figma-icon.svg"
    }
  ],
  "projets": [
    {
      "id": "1",
      "titre": "Kasa",
      "cover": "/assets/cover/kasa-cover.jpg",
      "lien": "https://p6-kasa-delta.vercel.app/",
      "contexte": [
        "Il s’agit ici d’un projet d’étude pour développer un front-end fonctionnel en React.js avec un back-end pas encore construit.",
        "Une refonte totale pour passer à une stack complète en JavaScript a été lancée et je me suis occupé du front-end en React.js."
      ],
      "description": [
        "Un site de location d'appartement a lancé sa refonte complète et je me suis occupé du front-end.",
        "Kasa fut pour ma part mon premier projet en React.js et quel bonheur.",
        "L'aspect le plus important était de comprendre le système de composant et de se familiariser avec React-router-dom et son routing. Et je me suis senti comme un poisson dans l'eau. De plus l'utilisation des hooks et des props à rendu ce projet hyper rapide à sa conception et cela a rendu pour moi l'expérience encore plus agréable, je me suis vite rendu compte de pourquoi le choix avait été porté sur cette technologie là.",
        "Il n'y a pas forcément eu d'aspect compliquédans ce projet car il s'agissait de surtout adopter une méthodologie qui dans mon cas était naturel et proche de ma façon de penser."
      ],
      "stack": ["React.js", "Reac-router-dom", "Sass"],
      "objectifs": [
        "Mettre en place un environnement sous React.js & Sass",
        "Configurer la navigation entre les pages de l'application avec React-router-dom",
        "Développer des éléments de l'interface d'un site web grâce à des composants React.js",
        "Mettre en œuvre des animations CSS de ces composants"
      ],
      "images": [
        "/assets/project/kasa-home.jpeg",
        "/assets/project/kasa-location.jpeg",
        "/assets/project/kasa-dropdown.jpeg"
      ]
    },
    {
      "id": "2",
      "titre": "Grimoire",
      "cover": "/assets/cover/grimoire-cover.jpg",
      "lien": "https://github.com/Czrentin/P7-Grimoire",
      "contexte": [
        "Il s’agit ici d’un projet d’étude pour développer un back-end fonctionnel avec Node.js et une base de données non relationnelle.",
        "Le client souhaite ouvrir un site de notation de livres au nom de sa chaîne de librairies et veut intégrer un aspect écologique dedans avec du GreenCode."
      ],
      "description": [
        "Le client est le gérant d’une petite chaîne de librairies qui souhaite ouvrir un site de référencement et de notation de livres à son nom.",
        "Pour développer le tout j’ai eu à ma disposition les spécifications fonctionnelles du site, celle de l’API et bien sûr le code du front-end.",
        "La partie la plus difficile de ce projet reste sans aucun doute cet aspect GreenCode, il m'a fallu me familiariser avec des documentations de librairies et les adapter à mes besoins. (Ce qui n'a pas été aussi évident que ça.)",
        "Il y a aussi eu beaucoup de temps consacrée à l'aspect droit des utilisateurs, pour qu'ils ne puissent pas supprimer les livres ou les avis que les autres auraient postés par exemple."
      ],
      "stack": ["Node.js", "Express.js", "MongoDB", "Différentes librairies JS"],
      "objectifs": [
        "Implémenter un modèle logique de données conformément à la réglementation",
        "Mettre en œuvre des opérations CRUD de manière sécurisée",
        "Stocker des données de manière sécurisée",
        "Développer en respectant des pratiques de GreenCode"
      ],
      "images": [
        "/assets/project/mon-vieux-grimoire-home.jpeg",
        "/assets/project/mon-vieux-grimoire-published.jpeg",
        "/assets/project/mon-vieux-grimoire-book.jpeg"
      ]
    },
    {
      "id": "3",
      "titre": "Architecte",
      "cover": "/assets/cover/portfolio-architecte-cover.jpg",
      "lien": "https://github.com/Czrentin/P3-Portfolio-Architecte",
      "contexte": [
        "Il s’agit ici d’un projet d’étude pour développer un front-end dynamique à l'aide d'une API.",
        "Il consiste à reprendre une base existante d’un site vitrine statique développé en Javascript pour en faire quelque chose de dynamique.",
        "Tout ceci est relié par une API Swagger que j’ai utiliser pour implémenter toutes les actions CRUD sur le site et permettre à la cliente de modifier le contenu comme bon lui semble via une authentification."
      ],
      "description": [
        "Le but de ce projet était donc d'améliorer le site portfolio d’une architecte d’intérieur en le rendant dynamique, le tout avec une API.",
        "Pour ça j'ai eu à ma disposition pas mal de choses, comme un figma complet avec toutes les étapes et écrans à intégrer, une documentation de l'API et un Kanban des différentes fonctionnalités.",
        "La plus grosse difficulté du projet consistait à implémenter la connexion pour avoir les autorisations nécessaires pour faire toutes les autres actions.",
        "Dans toute cette partie de d'implémentation et de tests un outil m'a été particulièrement utile : Postman. C'est avec lui que j'ai pu tester toutes mes requêtes API et vérifier une par une qu'elles fonctionnaient toutes comme attendues."
      ],
      "stack": ["JavaScript", "HTML", "CSS"],
      "objectifs": [
        "Gérer les événements utilisateurs",
        "Manipuler les éléments du DOM pour avoir un site dynamique",
        "Récupérer les données utilisateurs via des formulaires",
        "Gérer une connexion et une clé d'authentification"
      ],
      "images": [
        "/assets/project/portfolio-architecte-home.jpeg",
        "/assets/project/portfolio-architecte-login.jpeg",
        "/assets/project/portfolio-architecte-works.jpeg"
      ]
    }
  ]
}
